[
  {
    "id": "yuvod",
    "title": {
      "es": "YUVOD – Plataforma OTT para Hoteles",
      "en": "YUVOD – OTT Platform for Hotels"
    },
    "description": {
      "es": "Plataforma de streaming multiplataforma para SmartTVs, móviles y web con arquitectura multientrada y selección dinámica de UI. Navegación espacial avanzada con NavigationHandlerBloc, soporte para menús anidados, grids y carruseles. Reproductor modular con DRM, subtítulos dinámicos, autenticación por token y pantalla completa. DevOps con RPS en pubspec.yaml, Docker Compose y Git Hooks en Dart.",
      "en": "Cross-platform streaming platform for SmartTVs, mobile, and web with multi-entry architecture and dynamic UI selection. Advanced spatial navigation with NavigationHandlerBloc, support for nested menus, grids, and carousels. Modular player with DRM, dynamic subtitles, token authentication, and fullscreen. DevOps with RPS in pubspec.yaml, Docker Compose, and Git Hooks in Dart."
    },
    "impact": {
      "es": "Desplegada en +30 hoteles en Europa y LATAM. Experiencia fluida en SmartTV, despliegues confiables y arquitectura extensible. Mejora del 35% en satisfacción de huéspedes según encuestas post-estancia.",
      "en": "Deployed in +30 hotels across Europe and LATAM. Smooth SmartTV experience, reliable deployments, and extensible architecture. 35% improvement in guest satisfaction according to post-stay surveys."
    },
    "stack": [
      "Flutter",
      "BLoC",
      "auto_route",
      "get_it",
      "Video.js",
      "Docker",
      "GitHub Actions",
      "WebSockets"
    ],
    "category": "business",
    "featured": true,
    "priority": 1,
    "liveUrl": "https://yuvod.com",
    "image": "yuvod_logo.svg",
    "tags": ["OTT", "SmartTV", "Streaming", "Hotels"],
    "status": "active",
    "createdAt": "2023-01-15T00:00:00.000Z",
    "updatedAt": "2024-06-01T00:00:00.000Z"
  },
  {
    "id": "bnc10",
    "title": {
      "es": "BNC10 – Neobanco Frontend",
      "en": "BNC10 – Neobanking Frontend"
    },
    "description": {
      "es": "Frontend de neobanco con responsive avanzado usando responsive_framework. Theming diferenciado para web y móvil. Monitoreo de errores en producción con Sentry. Modularización en core, resources, routing y commons. Buenas prácticas de UI/UX: orientación fija, control de escala, transiciones animadas. Seguridad bancaria con autenticación biométrica y storage encriptado.",
      "en": "Neobanking frontend with advanced responsive design using responsive_framework. Differentiated theming for web and mobile. Production error monitoring with Sentry. Modularization in core, resources, routing, and commons. UI/UX best practices: fixed orientation, scale control, animated transitions. Banking security with biometric authentication and encrypted storage."
    },
    "impact": {
      "es": "500+ usuarios activos, rating 4.7⭐, 99.5% de sesiones sin crashes. Reducción del 60% en fricción de autenticación. Experiencia fluida cross-platform.",
      "en": "500+ active users, 4.7⭐ rating, 99.5% crash-free sessions. 60% reduction in authentication friction. Smooth cross-platform experience."
    },
    "stack": [
      "Flutter",
      "GetX",
      "Firebase",
      "GetStorage",
      "responsive_framework",
      "Sentry"
    ],
    "category": "business",
    "featured": true,
    "priority": 2,
    "image": "bnc10_logo.svg",
    "tags": ["Banking", "Fintech", "Security"],
    "status": "active",
    "createdAt": "2023-03-01T00:00:00.000Z",
    "updatedAt": "2024-05-15T00:00:00.000Z"
  },
  {
    "id": "tookane",
    "title": {
      "es": "TOOKANE – App Multipropósito",
      "en": "TOOKANE – Multipurpose App"
    },
    "description": {
      "es": "Aplicación multipropósito con Clean Architecture + MVVM + Repository Pattern. Autenticación multiplataforma (correo, Google, Facebook), gestión de usuarios y perfiles, consumo de APIs externas y visualización de datos. Notificaciones push, soporte offline-first con Hive/SharedPreferences, internacionalización multiidioma, animaciones y transiciones personalizadas. CI/CD para despliegues automatizados.",
      "en": "Multipurpose application with Clean Architecture + MVVM + Repository Pattern. Cross-platform authentication (email, Google, Facebook), user and profile management, external API consumption and data visualization. Push notifications, offline-first support with Hive/SharedPreferences, multi-language internationalization, custom animations and transitions. CI/CD for automated deployments."
    },
    "impact": {
      "es": "Buenas prácticas con linter, análisis estático, pruebas unitarias y de widgets, documentación clara y CI/CD. Mejora del 30% en eficiencia mediante optimización basada en datos reales.",
      "en": "Best practices with linter, static analysis, unit and widget tests, clear documentation and CI/CD. 30% improvement in efficiency through real data-based optimization."
    },
    "stack": [
      "Flutter",
      "Provider",
      "Riverpod",
      "BLoC",
      "Firebase",
      "Hive",
      "SharedPreferences"
    ],
    "category": "business",
    "featured": true,
    "priority": 3,
    "liveUrl": "https://tookane.com",
    "image": "tookane_logo.svg",
    "tags": ["Multipurpose", "Authentication", "Offline"],
    "status": "active",
    "createdAt": "2022-08-01T00:00:00.000Z",
    "updatedAt": "2024-04-20T00:00:00.000Z"
  },
  {
    "id": "stelcamping",
    "title": {
      "es": "STELCAMPING – Gestión de Campings",
      "en": "STELCAMPING – Camping Management"
    },
    "description": {
      "es": "Aplicación integral para gestión de campings con clase base BaseState<T> para centralizar diálogos, localización, foco y utilidades de UI. Sistema de registro, autenticación, reservas, calendario de actividades, notificaciones y perfil. Integración con APIs REST (auth, reservas, actividades, notificaciones, perfil). Arquitectura modular con separación clara entre presentación, lógica de negocio y datos.",
      "en": "Comprehensive camping management application with BaseState<T> base class to centralize dialogs, localization, focus, and UI utilities. Registration, authentication, reservations, activities calendar, notifications, and profile system. Integration with REST APIs (auth, reservations, activities, notifications, profile). Modular architecture with clear separation between presentation, business logic, and data layers."
    },
    "impact": {
      "es": "Más de 1,000 usuarios activos. Reutilización de código, consistencia en UX y escalabilidad. Automatizó procesos que antes requerían 3 personas, reduciendo costes operativos en 40%.",
      "en": "More than 1,000 active users. Code reusability, UX consistency, and scalability. Automated processes that previously required 3 people, reducing operational costs by 40%."
    },
    "stack": [
      "Flutter",
      "Firebase",
      "GetX/BLoC",
      "dio",
      "StringLocalizations",
      "REST APIs"
    ],
    "category": "business",
    "featured": false,
    "priority": 4,
    "liveUrl": "https://stel.es",
    "image": "stel_logo.svg",
    "tags": ["Tourism", "Management", "REST API"],
    "status": "active",
    "createdAt": "2022-05-01T00:00:00.000Z",
    "updatedAt": "2024-03-10T00:00:00.000Z"
  },
  {
    "id": "portfolio",
    "title": {
      "es": "Portfolio Personal – Chrystian Michell",
      "en": "Personal Portfolio – Chrystian Michell"
    },
    "description": {
      "es": "Portfolio personal moderno y responsive desarrollado con Astro para renderizado estático optimizado. Arquitectura modular con TypeScript, sistema de traducciones i18n, SEO avanzado con structured data, PWA con manifest y service worker. Optimización de performance con lazy loading, code splitting y compresión de assets. Deployment automatizado con GitHub Actions.",
      "en": "Modern and responsive personal portfolio developed with Astro for optimized static rendering. Modular architecture with TypeScript, i18n translation system, advanced SEO with structured data, PWA with manifest and service worker. Performance optimization with lazy loading, code splitting, and asset compression. Automated deployment with GitHub Actions."
    },
    "impact": {
      "es": "Lighthouse score 100/100 en todas las métricas. Tiempo de carga <1s, SEO optimizado para posicionamiento profesional. Internacionalización ES/EN completa.",
      "en": "Lighthouse score 100/100 in all metrics. Load time <1s, SEO optimized for professional positioning. Complete ES/EN internationalization."
    },
    "stack": [
      "Astro",
      "TypeScript",
      "CSS Modules",
      "GitHub Actions",
      "Netlify",
      "PWA"
    ],
    "category": "personal",
    "featured": true,
    "priority": 1,
    "liveUrl": "https://chrystian.dev",
    "githubUrl": "https://github.com/ImSoulRebel/chrystian_portfolio",
    "image": "placeholder.svg",
    "tags": ["Portfolio", "Astro", "Performance", "SEO"],
    "status": "active",
    "createdAt": "2024-10-01T00:00:00.000Z",
    "updatedAt": "2024-10-17T00:00:00.000Z"
  },
  {
    "id": "nextival",
    "title": {
      "es": "Nextival CMS – Gestión de Festivales",
      "en": "Nextival CMS – Festival Management"
    },
    "description": {
      "es": "Sistema de gestión de contenido para festivales musicales con Clean Architecture y Repository Pattern. API RESTful con Server Actions y middleware JWT. Integración con Spotify Web API y Geocoding API. Editor WYSIWYG (Quill.js) para gestión avanzada de artistas y escenarios. WebSockets para notificaciones y mensajería en tiempo real.",
      "en": "Content management system for music festivals with Clean Architecture and Repository Pattern. RESTful API with Server Actions and JWT middleware. Integration with Spotify Web API and Geocoding API. WYSIWYG editor (Quill.js) for advanced artist and stage management. WebSockets for real-time notifications and messaging."
    },
    "impact": {
      "es": "Tiempos de carga <1.5s con renderizado híbrido SSR/SSG, optimización SEO completa. Entregado en 4 meses como proyecto funcional para producción.",
      "en": "Load times <1.5s with hybrid SSR/SSG rendering, complete SEO optimization. Delivered in 4 months as a production-ready project."
    },
    "stack": [
      "Astro",
      "SolidJS",
      "TypeScript",
      "TailwindCSS",
      "WebSockets",
      "JWT",
      "Spotify API"
    ],
    "category": "personal",
    "featured": false,
    "priority": 2,
    "githubUrl": "https://github.com/ImSoulRebel/nextival-cms",
    "image": "nextival_logo.svg",
    "tags": ["CMS", "Music", "Festivals", "WebSockets"],
    "status": "active",
    "createdAt": "2024-01-15T00:00:00.000Z",
    "updatedAt": "2024-05-30T00:00:00.000Z"
  }
]
